src/Catalogs/Договоры/Договоры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Договоры</name>
  <owners>Catalog.Контрагенты</owners>
</mdclass:Catalog>

src/InformationRegisters/СкидкиПокупателей/СкидкиПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СкидкиПокупателей</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Договоры/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура УстановитьСкидку(Команда)
	УстановитьСкидкуНаСервере(ТекущаяСкидка);
    
    ПоказатьОповещениеПользователя("Новая скидка установлена!");
КонецПроцедуры

&НаСервере
Процедура УстановитьСкидкуНаСервере(НоваяСкидка)
		
	МенеджерЗаписи = РегистрыСведений.СкидкиПокупателей.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Период = НачалоДня(ТекущаяДата());
	МенеджерЗаписи.Контрагент = Объект.Владелец;
	МенеджерЗаписи.Договор = Объект.Ссылка;
	
	МенеджерЗаписи.Скидка = НоваяСкидка;
	
	МенеджерЗаписи.Записать();
КонецПроцедуры

&НаСервере
Процедура Сервер_ОбновитьСкидку()
	
	Отбор = Новый Структура;
	Отбор.Вставить("Контрагент", Объект.Владелец);
	Отбор.Вставить("Договор", Объект.Ссылка);
	
	ЗаписиРегистра = РегистрыСведений.СкидкиПокупателей.СрезПоследних(ТекущаяДата(), Отбор);
	
	Если ЗаписиРегистра.Количество() > 0 Тогда
		ТекущаяСкидка = ЗаписиРегистра[0].Скидка;
	Иначе
		ТекущаяСкидка = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Сервер_ОбновитьСкидку()
КонецПроцедуры
